const shortRanksEnum = {
  рекрут: 'рекр',
  солдат: 'солд',
  'стариший солдат': 'ст. солд',
  'молодший сержант': 'мл. с-т',
  сержант: 'с-т',
  'старший сержант': 'ст. с-т',
  'головний сержант': 'гл. с-т',
  'штаб-сержант': 'шт. с-т',
  'майстер-сержант': 'м-р с-т',
  'старший майстер-сержант': 'ст. м-р с-т',
  'головний майстер-сержант': 'гл. м-р с-т',
  'молодший лейтенант': 'мл. л-т',
  лейтенант: 'л-т',
  'старший лейтенант': 'ст. л-т',
  капітан: 'к-н',
  майор: 'м-р',
  підполковник: 'п-пк',
  полковник: 'п-к',
  'бригадний генерал': 'бр. ген',
  'генерал-майор': 'ген-май',
  'генерал-лейтенант': 'ген-лейт',
  генерал: 'ген',
};

module.exports = {
  shortRanksEnum,
};
